benchmarks/dockerize/history/benchmark-zero__2025-07-24.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating zero_wrk-hello_1 ... 
Creating zero_wrk-hello_1 ... done
Attaching to zero_wrk-hello_1
wrk-hello_1        | Running 30s test @ http://gateway:8000/hello
wrk-hello_1        |   8 threads and 80 connections
wrk-hello_1        |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1        |     Latency     3.65ms    1.69ms  15.71ms   76.58%
wrk-hello_1        |     Req/Sec     2.80k   666.71     4.76k    63.94%
wrk-hello_1        |   Latency Distribution
wrk-hello_1        |      50%    3.12ms
wrk-hello_1        |      75%    4.59ms
wrk-hello_1        |      90%    5.78ms
wrk-hello_1        |      99%    9.44ms
wrk-hello_1        |   669629 requests in 30.10s, 73.44MB read
wrk-hello_1        | Requests/sec:  22248.28
wrk-hello_1        | Transfer/sec:      2.44MB
zero_wrk-hello_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating zero_wrk-order_1 ... 
Creating zero_wrk-order_1 ... done
Attaching to zero_wrk-order_1
wrk-order_1        | Running 30s test @ http://gateway:8000/order
wrk-order_1        |   8 threads and 80 connections
wrk-order_1        |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1        |     Latency     7.33ms    3.43ms  29.38ms   71.88%
wrk-order_1        |     Req/Sec     1.39k   380.54     2.63k    65.71%
wrk-order_1        |   Latency Distribution
wrk-order_1        |      50%    6.66ms
wrk-order_1        |      75%    9.09ms
wrk-order_1        |      90%   12.01ms
wrk-order_1        |      99%   18.15ms
wrk-order_1        |   331902 requests in 30.03s, 58.24MB read
wrk-order_1        | Requests/sec:  11051.80
wrk-order_1        | Transfer/sec:      1.94MB
zero_wrk-order_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating zero_wrk-hello-async_1 ... 
Creating zero_wrk-hello-async_1 ... done
Attaching to zero_wrk-hello-async_1
wrk-hello-async_1  | Running 30s test @ http://gateway:8000/async_hello
wrk-hello-async_1  |   8 threads and 80 connections
wrk-hello-async_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello-async_1  |     Latency     2.98ms    2.11ms  93.99ms   91.91%
wrk-hello-async_1  |     Req/Sec     3.45k   666.13     6.94k    85.62%
wrk-hello-async_1  |   Latency Distribution
wrk-hello-async_1  |      50%    2.68ms
wrk-hello-async_1  |      75%    3.67ms
wrk-hello-async_1  |      90%    4.83ms
wrk-hello-async_1  |      99%    6.66ms
wrk-hello-async_1  |   824390 requests in 30.01s, 90.41MB read
wrk-hello-async_1  |   Socket errors: connect 0, read 0, write 0, timeout 1
wrk-hello-async_1  |   Non-2xx or 3xx responses: 1
wrk-hello-async_1  | Requests/sec:  27466.46
wrk-hello-async_1  | Transfer/sec:      3.01MB
zero_wrk-hello-async_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating zero_wrk-order-async_1 ... 
Creating zero_wrk-order-async_1 ... done
Attaching to zero_wrk-order-async_1
wrk-order-async_1  | Running 30s test @ http://gateway:8000/async_order
wrk-order-async_1  |   8 threads and 80 connections
wrk-order-async_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order-async_1  |     Latency     4.41ms    2.42ms  54.19ms   74.14%
wrk-order-async_1  |     Req/Sec     2.34k   366.85     6.08k    72.44%
wrk-order-async_1  |   Latency Distribution
wrk-order-async_1  |      50%    3.89ms
wrk-order-async_1  |      75%    5.67ms
wrk-order-async_1  |      90%    7.49ms
wrk-order-async_1  |      99%   12.04ms
wrk-order-async_1  |   560496 requests in 30.09s, 98.35MB read
wrk-order-async_1  | Requests/sec:  18625.51
wrk-order-async_1  | Transfer/sec:      3.27MB
zero_wrk-order-async_1 exited with code 0