benchmarks/dockerize/history/benchmark-zero__2025-07-26.log
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating zero_wrk-hello_1 ... 
Creating zero_wrk-hello_1 ... done
Attaching to zero_wrk-hello_1
wrk-hello_1        | Running 30s test @ http://gateway:8000/hello
wrk-hello_1        |   8 threads and 80 connections
wrk-hello_1        |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello_1        |     Latency     3.59ms    1.66ms  25.45ms   72.57%
wrk-hello_1        |     Req/Sec     2.84k   683.17     5.34k    69.75%
wrk-hello_1        |   Latency Distribution
wrk-hello_1        |      50%    3.27ms
wrk-hello_1        |      75%    4.43ms
wrk-hello_1        |      90%    5.83ms
wrk-hello_1        |      99%    8.86ms
wrk-hello_1        |   677269 requests in 30.03s, 74.28MB read
wrk-hello_1        | Requests/sec:  22556.58
wrk-hello_1        | Transfer/sec:      2.47MB
zero_wrk-hello_1 exited with code 0
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating zero_wrk-order_1 ... 
Creating zero_wrk-order_1 ... done
Attaching to zero_wrk-order_1
wrk-order_1        | Running 30s test @ http://gateway:8000/order
wrk-order_1        |   8 threads and 80 connections
wrk-order_1        |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order_1        |     Latency     7.01ms    3.76ms  46.53ms   79.91%
wrk-order_1        |     Req/Sec     1.48k   370.10     2.82k    64.50%
wrk-order_1        |   Latency Distribution
wrk-order_1        |      50%    6.11ms
wrk-order_1        |      75%    8.63ms
wrk-order_1        |      90%   11.57ms
wrk-order_1        |      99%   20.13ms
wrk-order_1        |   353686 requests in 30.03s, 62.06MB read
wrk-order_1        | Requests/sec:  11779.06
wrk-order_1        | Transfer/sec:      2.07MB
zero_wrk-order_1 exited with code 0
redis is up-to-date
server is up-to-date
gateway is up-to-date
Creating zero_wrk-hello-async_1 ... 
Creating zero_wrk-hello-async_1 ... done
Attaching to zero_wrk-hello-async_1
wrk-hello-async_1  | Running 30s test @ http://gateway:8000/async_hello
wrk-hello-async_1  |   8 threads and 80 connections
wrk-hello-async_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello-async_1  |     Latency     2.38ms    1.47ms  56.74ms   83.65%
wrk-hello-async_1  |     Req/Sec     4.32k     0.85k    9.10k    83.75%
wrk-hello-async_1  |   Latency Distribution
wrk-hello-async_1  |      50%    2.12ms
wrk-hello-async_1  |      75%    2.75ms
wrk-hello-async_1  |      90%    4.07ms
wrk-hello-async_1  |      99%    5.73ms
wrk-hello-async_1  |   1032661 requests in 30.01s, 113.25MB read
wrk-hello-async_1  |   Socket errors: connect 0, read 0, write 0, timeout 3
wrk-hello-async_1  |   Non-2xx or 3xx responses: 3
wrk-hello-async_1  | Requests/sec:  34411.23
wrk-hello-async_1  | Transfer/sec:      3.77MB
zero_wrk-hello-async_1 exited with code 0
server is up-to-date
redis is up-to-date
gateway is up-to-date
Creating zero_wrk-order-async_1 ... 
Creating zero_wrk-order-async_1 ... done
Attaching to zero_wrk-order-async_1
wrk-order-async_1  | Running 30s test @ http://gateway:8000/async_order
wrk-order-async_1  |   8 threads and 80 connections
wrk-order-async_1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order-async_1  |     Latency     3.51ms    3.61ms 201.73ms   96.27%
wrk-order-async_1  |     Req/Sec     2.97k   608.29     5.76k    83.50%
wrk-order-async_1  |   Latency Distribution
wrk-order-async_1  |      50%    3.10ms
wrk-order-async_1  |      75%    4.22ms
wrk-order-async_1  |      90%    5.56ms
wrk-order-async_1  |      99%    8.13ms
wrk-order-async_1  |   709911 requests in 30.03s, 124.57MB read
wrk-order-async_1  | Requests/sec:  23638.82
wrk-order-async_1  | Transfer/sec:      4.15MB
zero_wrk-order-async_1 exited with code 0