benchmarks/dockerize/history/benchmark-zero__2025-12-21.log
 Container redis  Running
 Container server  Running
 Container gateway  Running
 Container zero-wrk-hello-1  Creating
 Container zero-wrk-hello-1  Created
Attaching to wrk-hello-1
wrk-hello-1  | Running 30s test @ http://gateway:8000/hello
wrk-hello-1  |   8 threads and 80 connections
wrk-hello-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello-1  |     Latency     2.92ms    1.18ms  16.04ms   74.51%
wrk-hello-1  |     Req/Sec     3.47k   527.61     5.87k    73.88%
wrk-hello-1  |   Latency Distribution
wrk-hello-1  |      50%    2.67ms
wrk-hello-1  |      75%    3.45ms
wrk-hello-1  |      90%    4.53ms
wrk-hello-1  |      99%    6.65ms
wrk-hello-1  |   827660 requests in 30.02s, 90.77MB read
wrk-hello-1  | Requests/sec:  27570.85
wrk-hello-1  | Transfer/sec:      3.02MB
wrk-hello-1 exited with code 0
 Container server  Running
 Container redis  Running
 Container gateway  Running
 Container zero-wrk-order-1  Creating
 Container zero-wrk-order-1  Created
Attaching to wrk-order-1
wrk-order-1  | Running 30s test @ http://gateway:8000/order
wrk-order-1  |   8 threads and 80 connections
wrk-order-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order-1  |     Latency     8.04ms    4.37ms  77.07ms   77.78%
wrk-order-1  |     Req/Sec     1.29k   418.94     2.62k    62.00%
wrk-order-1  |   Latency Distribution
wrk-order-1  |      50%    6.96ms
wrk-order-1  |      75%    9.85ms
wrk-order-1  |      90%   13.69ms
wrk-order-1  |      99%   23.71ms
wrk-order-1  |   308358 requests in 30.03s, 54.11MB read
wrk-order-1  | Requests/sec:  10269.10
wrk-order-1  | Transfer/sec:      1.80MB
wrk-order-1 exited with code 0
 Container server  Running
 Container redis  Running
 Container gateway  Running
 Container zero-wrk-hello-async-1  Creating
 Container zero-wrk-hello-async-1  Created
Attaching to wrk-hello-async-1
wrk-hello-async-1  | Running 30s test @ http://gateway:8000/async_hello
wrk-hello-async-1  |   8 threads and 80 connections
wrk-hello-async-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-hello-async-1  |     Latency     2.04ms    2.48ms  93.54ms   99.19%
wrk-hello-async-1  |     Req/Sec     5.17k     1.12k    9.86k    68.41%
wrk-hello-async-1  |   Latency Distribution
wrk-hello-async-1  |      50%    1.77ms
wrk-hello-async-1  |      75%    2.50ms
wrk-hello-async-1  |      90%    3.28ms
wrk-hello-async-1  |      99%    4.41ms
wrk-hello-async-1  |   1236855 requests in 30.10s, 135.65MB read
wrk-hello-async-1  |   Socket errors: connect 0, read 0, write 0, timeout 6
wrk-hello-async-1  |   Non-2xx or 3xx responses: 6
wrk-hello-async-1  | Requests/sec:  41091.96
wrk-hello-async-1  | Transfer/sec:      4.51MB
wrk-hello-async-1 exited with code 0
 Container redis  Running
 Container server  Running
 Container gateway  Running
 Container zero-wrk-order-async-1  Creating
 Container zero-wrk-order-async-1  Created
Attaching to wrk-order-async-1
wrk-order-async-1  | Running 30s test @ http://gateway:8000/async_order
wrk-order-async-1  |   8 threads and 80 connections
wrk-order-async-1  |   Thread Stats   Avg      Stdev     Max   +/- Stdev
wrk-order-async-1  |     Latency     3.65ms    5.53ms 193.30ms   99.16%
wrk-order-async-1  |     Req/Sec     3.02k   366.93     5.37k    87.29%
wrk-order-async-1  |   Latency Distribution
wrk-order-async-1  |      50%    3.15ms
wrk-order-async-1  |      75%    4.08ms
wrk-order-async-1  |      90%    5.13ms
wrk-order-async-1  |      99%    8.64ms
wrk-order-async-1  |   720360 requests in 30.02s, 126.41MB read
wrk-order-async-1  | Requests/sec:  23996.18
wrk-order-async-1  | Transfer/sec:      4.21MB
wrk-order-async-1 exited with code 0